<a href="https://colab.research.google.com/github/vikasbda21/Python/blob/main/Pandas_Read_and_Write_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Pandas
pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series.

### Series:-
Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index.

In [ ]:
# import pandas library
import pandas as pd
import numpy as np

In [ ]:
# create empty series
s = pd.Series(dtype = 'float64')
print(s)

Series([], dtype: float64)

In [ ]:
# Creating a series from array
data = np.array([1,2,3,45])

s = pd.Series(data)
print(s)

0     1
1     2
2     3
3    45
dtype: int32

In [ ]:
data = np.array([1,2,3,45])

s = pd.Series(data, index=['A','B','C','D'])
print(s) a
B    b
C    c
D    d
dtype: object

A     1
B     2
C     3
D    45
dtype: int32

In [ ]:
data = np.array(['a','b','c','d'])

s = pd.Series(data, index=['A','B','C','D'])
print(s)

A    a
B    b
C    c
D    d
dtype: object

In [ ]:
# Indexing and selecting data in series
s['C']

'c'

In [ ]:
s[:2]

A    a
B    b
dtype: object

### DataFrame:-
A DataFrame is a data structure that organizes data into a 2-dimensional table of rows and columns.

In [ ]:
# create an Empty DataFrame object
df = pd.DataFrame()

print(df)

Empty DataFrame
Columns: []
Index: []

In [ ]:
# Create dataframe using array
df = pd.DataFrame(np.arange(0,20).reshape(5,4))
print(df)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [ ]:
# Create dataframe using array
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['row1','row2','row3','row4','row5'], columns=['col1','col2','col3','col4'])
print(df)

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [ ]:
# Create DataFrame from Dict of list
data = {'Name':['Abhinav','Arun','Chandra D K', 'Harish'], 'Age':[22,24,30,28], 'Score':[28,27,29,28]}
df = pd.DataFrame(data)
print(df)

          Name  Age  Score
0      Abhinav   22     28
1         Arun   24     27
2  Chandra D K   30     29
3       Harish   28     28

In [ ]:
# Nan-Not a Number
data = np.array([23,56,np.nan,45,77])
df = pd.DataFrame(data)
df

      0
0  23.0
1  56.0
2   NaN
3  45.0
4  77.0

In [ ]:
data = np.random.rand(10,5)

In [ ]:
df = pd.DataFrame(data, index=['row1','row2','row3','row4','row5','row6','row7','row8','row9','row10'], columns=['col1','col2','col3','col4','col5'])
df

           col1      col2      col3      col4      col5
row1   0.564562  0.228758  0.724750  0.928026  0.787264
row2   0.865509  0.414917  0.321581  0.451109  0.990638
row3   0.957848  0.621455  0.872263  0.114905  0.694732
row4   0.317213  0.146126  0.137811  0.917500  0.009754
row5   0.588448  0.120439  0.869203  0.705845  0.366290
row6   0.727283  0.798770  0.974376  0.956268  0.648735
row7   0.604266  0.809422  0.674438  0.728951  0.640612
row8   0.639005  0.102897  0.700446  0.690821  0.016842
row9   0.425794  0.795606  0.410517  0.423007  0.107855
row10  0.576991  0.221609  0.518276  0.298123  0.135029

In [ ]:
# head() function
df.head()

          col1      col2      col3      col4      col5
row1  0.564562  0.228758  0.724750  0.928026  0.787264
row2  0.865509  0.414917  0.321581  0.451109  0.990638
row3  0.957848  0.621455  0.872263  0.114905  0.694732
row4  0.317213  0.146126  0.137811  0.917500  0.009754
row5  0.588448  0.120439  0.869203  0.705845  0.366290

In [ ]:
# tail() function
df.tail()

           col1      col2      col3      col4      col5
row6   0.727283  0.798770  0.974376  0.956268  0.648735
row7   0.604266  0.809422  0.674438  0.728951  0.640612
row8   0.639005  0.102897  0.700446  0.690821  0.016842
row9   0.425794  0.795606  0.410517  0.423007  0.107855
row10  0.576991  0.221609  0.518276  0.298123  0.135029

In [ ]:
# info()
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, row1 to row10
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    10 non-null     float64
 1   col2    10 non-null     float64
 2   col3    10 non-null     float64
 3   col4    10 non-null     float64
 4   col5    10 non-null     float64
dtypes: float64(5)
memory usage: 480.0+ bytes

In [ ]:
df.describe()

            col1       col2       col3       col4       col5
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean    0.626692   0.426000   0.620366   0.621456   0.439775
std     0.188974   0.301418   0.268228   0.288050   0.356750
min     0.317213   0.102897   0.137811   0.114905   0.009754
25%     0.567670   0.164997   0.437456   0.430033   0.114648
50%     0.596357   0.321838   0.687442   0.698333   0.503451
75%     0.705213   0.752068   0.833089   0.870362   0.683233
max     0.957848   0.809422   0.974376   0.956268   0.990638

In [ ]:
df.min()

col1    0.317213
col2    0.102897
col3    0.137811
col4    0.114905
col5    0.009754
dtype: float64

In [ ]:
df.max()

col1    0.957848
col2    0.809422
col3    0.974376
col4    0.956268
col5    0.990638
dtype: float64

###### Read csv using read_csv()

In [ ]:
df = pd.read_csv('aug_train.csv')

In [ ]:
df

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
 13  target                  19158 non-null  float64
dtypes: float64(2), int64(2), object(10)
memory usage: 2.0+ MB

In [ ]:
df.isnull().sum()

enrollee_id                  0
city                         0
city_development_index       0
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
last_new_job               423
training_hours               0
target                       0
dtype: int64

### Sep Parameter

### Index_col parameter

### Header Parameter

### use_cols parameter

# Skiprows/ nrows

### dtypes parameters

# Skip bad lines

# Read Json Dataset

#### DataFrame to convert into csv file using to_csv()

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# Read CSV File
titanic_df = pd.read_csv('train.csv')

In [ ]:
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Shape of data?

In [ ]:
titanic_df.shape

(891, 12)

### How does the data look like?

In [ ]:
titanic_df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
711,712,0,1,"Klaber, Mr. Herman",male,NaN,0,0,113028,26.5500,C124,S
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
812,813,0,2,"Slemen, Mr. Richard James",male,35.0,0,0,28206,10.5000,NaN,S
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,7.7500,NaN,Q
643,644,1,3,"Foo, Mr. Choong",male,NaN,0,0,1601,56.4958,NaN,S
848,849,0,2,"Harper, Rev. John",male,28.0,0,1,248727,33.0000,NaN,S
230,231,1,1,"Harris, Mrs. Henry Birkhardt (Irene Wallach)",female,35.0,1,0,36973,83.4750,C83,S
673,674,1,2,"Wilhelms, Mr. Charles",male,31.0,0,0,244270,13.0000,NaN,S
399,400,1,2,"Trout, Mrs. William H (Jessie L)",female,28.0,0,0,240929,12.6500,NaN,S
246,247,0,3,"Lindahl, Miss. Agda Thorilda Viktoria",female,25.0,0,0,347071,7.7750,NaN,S

### What is the data type of cols?

In [ ]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#### check null values

In [ ]:
titanic_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### Describe the data

In [ ]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### Check duplicated values

In [ ]:
titanic_df.duplicated().sum()

0

### Correlation between columns

In [ ]:
titanic_df.corr()['Survived']

PassengerId   -0.005007
Survived       1.000000
Pclass        -0.338481
Age           -0.077221
SibSp         -0.035322
Parch          0.081629
Fare           0.257307
Name: Survived, dtype: float64